VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re45_ogrid/openfoam_setup/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

nu              1.51578e-05;

beta            0.00341122;

TRef            293.15;

Pr              0.713;

Prt             0.9;
